InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДополнительныеМатериалыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДополнительныеМатериалыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОприходованныеОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОприходованныеОбъектыЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаВыбораРеализацииОпт/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Параметры.Свойство("Документ") Тогда
		Ломбард = Параметры.Документ.Ломбард;
		Склад = Параметры.Документ.Склад;  
		Организация = Параметры.Документ.Организация; 
		Дата = Параметры.Документ.Дата;
		ПодбиратьПо = 1;
		УстановитьВидимость(); 		
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если ПодбиратьПо = 1 Тогда
		Элементы.ГруппаВес.Видимость = Истина;
	Иначе
		Элементы.ГруппаВес.Видимость = Ложь;
		ВесОт = 0;
		ВесДо = 0;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");
	ИтогВесНовый = ТаблицаТоваров.Итог("ВесМеталлаНовый"); 
	ИтогВесСтарый = ТаблицаТоваров.Итог("ВесМеталла"); 
  	ИтогЦена = ТаблицаТоваров.Итог("ОптоваяЦена");
КонецПроцедуры	  

&НаСервере
Функция РассчитатьВесПоПробе(ПробаСтарая, ВесСтарый)
	Если (Проба.Проба = 585 И ПробаСтарая.Проба = 583) ИЛИ 
		 (Проба.Проба = 583 И ПробаСтарая.Проба = 585) Тогда
		Возврат ВесСтарый;
	Иначе	
	    Возврат ВесСтарый*ПробаСтарая.Проба/Проба.Проба; 
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция РассчитатьЦену(ВесНовый)
	Возврат ВесНовый*ЦенаЗаГрамм; 
КонецФункции  

&НаСервере
Функция ПроверитьВес(ВесНовый) 
	Если ВесДо = 0 Тогда
		Возврат Истина;
	КонецЕсли;	
	ВесДляПроверки = ВесНовыйВ + ВесНовый;
	Если ВесДляПроверки < ВесДо Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаСервере
Процедура ЗаполнитьТаблицуТоваров()  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из Товары Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	       
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);  
	Запрос.УстановитьПараметр("Металл", Металл);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	1 КАК Количество,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних.Период КАК ДатаОприходования,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиМеталл,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОприходованныеОбъектыЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба.Владелец = &Металл
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОприходования";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса);  
	УдСтроки = Новый СписокЗначений;    
	ВесНовыйВ = 0;
	КоличествоВ = 0;

	Для каждого Стр Из ТаблицаТоваров Цикл
		 СтрокаДолжнаПопадатьВИтоги=истина; //lion 14.08.2025
		 РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
		 Если НЕ РезультатПроверки = неопределено Тогда 
			 СтрокаДолжнаПопадатьВИтоги=Ложь; //lion 14.08.2025
			 УдСтроки.Добавить(Стр);    
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			 Если ЗначениеЗаполнено(РезультатПроверки.Регистратор) Тогда
			     ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ» № " + СокрЛП(РезультатПроверки.Регистратор.ПредставлениеНомера) + " от " + Формат(РезультатПроверки.Регистратор.Дата, "ДЛФ=");
			 Иначе 
				 ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ», ответственный " + СокрЛП(РезультатПроверки.Ответственный);
			 КонецЕсли;	 
			 ТекстСообщения = ТекстСообщения + ". Добавление в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 КонецЕсли;	   
		 Если ЛБ_УправлениеЛомбардом.ПроверитьЗалоговыйБилетСогласованКОплате(Дата, Стр.ЗалоговыйБилет) Тогда   
			 СтрокаДолжнаПопадатьВИтоги=Ложь; //lion 14.08.2025
			 УдСтроки.Добавить(Стр);                                                                                   
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			 ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета) + " согласован к оплате, невостребованный залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 КонецЕсли;	
		 Если ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата, Стр.ЗалоговыйБилет) = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ Тогда  
			Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета) + " выкуплен заемщиком, залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);      
			Продолжить;
		КонецЕсли;	
        Если СтрокаДолжнаПопадатьВИтоги тогда //lion 14.08.2025
			Стр.ВесМеталлаНовый = РассчитатьВесПоПробе(Стр.Проба, стр.ВесМеталла);
			Если ПодбиратьПо = 1 Тогда 
				Если ПроверитьВес(Стр.ВесМеталлаНовый) Тогда 
					Стр.Включить = Истина;  
					КоличествоВ = КоличествоВ + Стр.Количество;
					ВесНовыйВ = ВесНовыйВ + Стр.ВесМеталлаНовый;
				    Стр.ОптоваяЦена = РассчитатьЦену(Стр.ВесМеталлаНовый);
				КонецЕсли;	
			Иначе
				Стр.Включить = Истина;                                 
				КоличествоВ = КоличествоВ + Стр.Количество;
				ВесНовыйВ = ВесНовыйВ + Стр.ВесМеталлаНовый;
				Стр.ОптоваяЦена = РассчитатьЦену(Стр.ВесМеталлаНовый); 
			КонецЕсли;
		КонецЕсли; //lion 14.08.2025
	КонецЦикла;	  
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаТоваров.Удалить(Эл.Значение);
	КонецЦикла;

	ЗаполнитьИтоги(); 
	ОбновитьСтрокуИтоги();
КонецПроцедуры	

&НаСервере
Процедура ПолучитьТоварыПоОстаткам()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Дата, Организация, Ломбард, Склад); 	
	Товары.Загрузить(ТаблицаЗапроса); 
КонецПроцедуры	

&НаКлиенте
Процедура Заполнить(Команда) 
	Если НЕ ЗначениеЗаполнено(Проба) Тогда
		Предупреждение("Не выбрана проба металла для расчета!", 60);
		Возврат;
	КонецЕсли; 	
	ПолучитьТоварыПоОстаткам();
	ЗаполнитьТаблицуТоваров();
КонецПроцедуры 

&НаСервере
Процедура ДобавитьВТаблицуТоваров(ТаблицаОЗ)     	
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаОЗ Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.УстановитьПараметр("Металл", Металл);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	1 КАК Количество,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних.Период КАК ДатаОприходования,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценкиМеталл,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДополнительныеМатериалыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба = ЛБ_ДополнительныеМатериалыОбъектаЗалогаСрезПоследних.Проба
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОприходованныеОбъектыЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ОприходованныеОбъектыЗалогаСрезПоследних.ОбъектЗалога
	               |ГДЕ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба.Владелец = &Металл
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОприходования";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
		Если НЕ РезультатПроверки = неопределено Тогда     
			Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			Если ЗначениеЗаполнено(РезультатПроверки.Регистратор) Тогда
			    ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ» № " + СокрЛП(РезультатПроверки.Регистратор.ПредставлениеНомера) + " от " + Формат(РезультатПроверки.Регистратор.Дата, "ДЛФ=");
			Иначе 
			    ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ», ответственный " + СокрЛП(РезультатПроверки.Ответственный);
			КонецЕсли;	 
			ТекстСообщения = ТекстСообщения + ". Добавление в текущий документ невозможно.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			Продолжить;
		КонецЕсли;	   
		Если ЛБ_УправлениеЛомбардом.ПроверитьЗалоговыйБилетСогласованКОплате(Дата, Стр.ЗалоговыйБилет) Тогда                                                                                     
			Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета) + " согласован к оплате, невостребованный залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);      
			Продолжить;
		КонецЕсли;	 
		Если ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата, Стр.ЗалоговыйБилет) = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ Тогда  
			Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(Стр.ЗалоговыйБилет.НомерЗалоговогоБилета) + " выкуплен заемщиком, залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);      
			Продолжить;
		КонецЕсли;	

		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если СтрокиТ.Количество() = 0 Тогда
		    НоваяСтр = ТаблицаТоваров.Добавить(); 
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.Артикул = Стр.Артикул;
			НоваяСтр.Проба = Стр.Проба;
			НоваяСтр.ВесИзделия = Стр.ВесИзделия;
			НоваяСтр.ВесМеталла = Стр.ВесМеталла;
			НоваяСтр.СуммаОценкиМеталл = Стр.СуммаОценкиМеталл;
			НоваяСтр.Количество = Стр.Количество;
			НоваяСтр.Вставки = Стр.Вставки;  
			НоваяСтр.Группа = Стр.Группа;  
			НоваяСтр.ДатаОприходования = Стр.ДатаОприходования;
			НоваяСтр.Категория = Стр.Категория;
			
			НоваяСтр.ВесМеталлаНовый = РассчитатьВесПоПробе(НоваяСтр.Проба, Новаястр.ВесМеталла);
			Если ПодбиратьПо = 1 Тогда 
				Если ПроверитьВес(НоваяСтр.ВесМеталлаНовый) Тогда 
					НоваяСтр.Включить = Истина;  
					КоличествоВ = КоличествоВ + НоваяСтр.Количество;
					ВесНовыйВ = ВесНовыйВ + НоваяСтр.ВесМеталлаНовый;
				    НоваяСтр.ОптоваяЦена = РассчитатьЦену(НоваяСтр.ВесМеталлаНовый);
				КонецЕсли;	
			Иначе
				НоваяСтр.Включить = Истина;                                 
				КоличествоВ = КоличествоВ + НоваяСтр.Количество; 
				ВесНовыйВ = ВесНовыйВ + НоваяСтр.ВесМеталлаНовый;
				НоваяСтр.ОптоваяЦена = РассчитатьЦену(НоваяСтр.ВесМеталлаНовый); 
			КонецЕсли;	

		КонецЕсли;	
	Конеццикла;    
	ЗаполнитьИтоги();  
	ОбновитьСтрокуИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьТоварыПоОстаткамАртикул(Артикул)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоАртикулу(Дата, Организация, Ломбард, Склад, Артикул);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " на складе не найдено.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда)   
	Если НЕ ЗначениеЗаполнено(Проба) Тогда
		Предупреждение("Не выбрана проба металла для расчета!", 60);
		Возврат;
	КонецЕсли; 	

	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамАртикул(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(Дата, Организация, Ломбард, Склад, НомерЗБ);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из залогогового билета № " + сокрЛП(НомерЗБ) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда)  
	Если НЕ ЗначениеЗаполнено(Проба) Тогда
		Предупреждение("Не выбрана проба металла для расчета!", 60);
		Возврат;
	КонецЕсли; 	

	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыВРеализации() 
	Для каждого Стр из ТаблицаТоваров цикл 
		Если НЕ стр.Включить Тогда
			Продолжить;
		КонецЕсли;	
	    НоваяСтр = Документ.Товары.Добавить();   
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
		НоваяСтр.Количество = Стр.Количество;
		НоваяСтр.ФактическаяЦена = Стр.ОптоваяЦена;		
	КонецЦикла;
КонецПроцедуры	 

&НаСервереБезКонтекста
Функция ЛБПолучитьАртикул(Дата,ЗалоговыйБилет,ОбъектЗалога)
	возврат ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Дата, ЗалоговыйБилет, ОбъектЗалога);
КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	Если ПодбиратьПо = 1 И НЕ ВесОт = 0 Тогда 
		Если ВесНовыйВ < ВесОт Тогда  
			Предупреждение("Указанный диапазон веса не достигнут!", 60);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	//lion+++ 14.08.2025               
	//проверка заполенения Оптовой цены по всем позициям
	ОбнаруженаНезаполненнаяОптоваяЦена=Ложь;
	//+МАН 09.10.25
	сч=1;
	//-МАН
	Для каждого СтрокаТаблицыТоваров из ТаблицаТоваров цикл
		//сч=1; //+МАН 09.10.25 Перенес выше иначе номер всегда был "1".
		//+МАН 09.10.25 Добавил проверку оптовой цены только по выбранным позициям
		Если СтрокаТаблицыТоваров.Включить Тогда
		//-МАН
			Если СтрокаТаблицыТоваров.ОптоваяЦена<=0 тогда
				Артикул = ЛБПолучитьАртикул(Дата, СтрокаТаблицыТоваров.ЗалоговыйБилет, СтрокаТаблицыТоваров.ОбъектЗалога);
				Сообщить("Не задана Оптовая цена в строке "+сч+ " для товара "+Артикул);
				ОбнаруженаНезаполненнаяОптоваяЦена=Истина;
			КонецЕсли;
		//+МАН 09.10.25
		КонецЕсли;
		//-МАН
		сч=сч+1;
	КонецЦикла;
	Если ОбнаруженаНезаполненнаяОптоваяЦена тогда
			Предупреждение("Есть позиции с пустой Оптовой Ценой", 60);
			Возврат;
		Возврат;                                           
	КонецЕсли;
	//lion--- 14.08.2025

	ЗаполнитьТоварыВРеализации();
	Закрыть(Документ);
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьЦену(Команда)
	Для каждого Стр из ТаблицаТоваров цикл  
		Если НЕ стр.Включить Тогда
			Продолжить;
		КонецЕсли;	  
		Стр.ОптоваяЦена = РассчитатьЦену(Стр.ВесМеталлаНовый);
	КонецЦикла;
	ЗаполнитьИтоги();  
	ОбновитьСтрокуИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицу()
	Для каждого Стр Из ТаблицаТоваров Цикл
        Стр.ВесМеталлаНовый = РассчитатьВесПоПробе(Стр.Проба, стр.ВесМеталла);
		Если Стр.Включить Тогда 
			Если ПроверитьВес(Стр.ВесМеталлаНовый) Тогда 
			    Стр.ОптоваяЦена = РассчитатьЦену(Стр.ВесМеталлаНовый);
			КонецЕсли; 
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры		
		

&НаСервере
Процедура ОбновитьСтрокуИтоги()   
	Элементы.ДекорацияКоличество.Заголовок = Строка(КоличествоВ);
	Элементы.ДекорацияИтоги.Заголовок = СокрЛП(Формат(ВесНовыйВ, "ЧЦ=10; ЧДЦ=2")); 
	Элементы.ДекорацияСумма.Заголовок = СокрЛП(Формат(ТаблицаТоваров.Итог("ОптоваяЦена"), "ЧЦ=15; ЧДЦ=2"));
КонецПроцедуры

&НаКлиенте
Процедура Округлить(Команда)
	Для каждого Стр из ТаблицаТоваров цикл  
		Если НЕ стр.Включить Тогда
			Продолжить;
		КонецЕсли;	  
		Стр.ОптоваяЦена = окр(Стр.ОптоваяЦена, 0, РежимОкругления.Окр15как20);
	КонецЦикла;
	ЗаполнитьИтоги(); 
	ОбновитьСтрокуИтоги();
КонецПроцедуры

&НаСервере
Функция ПолучитьМеталл()  
	Возврат Проба.Владелец;
КонецФункции

&НаКлиенте
Процедура ПробаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Проба) тогда 
		МеталлНовый = ПолучитьМеталл();
		Если НЕ МеталлНовый = Металл Тогда
			Металл = МеталлНовый;  
			ТаблицаТоваров.Очистить();
		Иначе
			ПересчитатьТаблицу(); 
		КонецЕсли;	
		ЗаполнитьИтоги();  
	    ОбновитьСтрокуИтоги();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодбиратьПоПриИзменении(Элемент)
	УстановитьВидимость(); 
	ТаблицаТоваров.Очистить();   
	КоличествоВ = 0;
	ВесНовыйВ = 0; 
	ЗаполнитьИтоги();
	ОбновитьСтрокуИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровВключитьПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока.Включить Тогда
		Если ПодбиратьПо = 1 Тогда 
			Если ПроверитьВес(ТекСтрока.ВесМеталлаНовый) Тогда 				  
				КоличествоВ = КоличествоВ + ТекСтрока.Количество;
				ВесНовыйВ = ВесНовыйВ + ТекСтрока.ВесМеталлаНовый;
			    ТекСтрока.ОптоваяЦена = РассчитатьЦену(ТекСтрока.ВесМеталлаНовый);
			Иначе
				ТекСтрока.Включить = ложь;
				Предупреждение("Превышен диапазон выбора веса металла", 60);
			КонецЕсли;	
		Иначе                                
			КоличествоВ = КоличествоВ + ТекСтрока.Количество;
			ВесНовыйВ = ВесНовыйВ + ТекСтрока.ВесМеталлаНовый;
			ТекСтрока.ОптоваяЦена = РассчитатьЦену(ТекСтрока.ВесМеталлаНовый); 
		КонецЕсли;	   
	иначе 
		КоличествоВ = КоличествоВ - ТекСтрока.Количество;
		ВесНовыйВ = ВесНовыйВ - ТекСтрока.ВесМеталлаНовый;
		ТекСтрока.ОптоваяЦена = 0; 
	КонецЕсли;	
    ЗаполнитьИтоги();  
	ОбновитьСтрокуИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМножественныйФильтр(Команда)
	 Если НЕ ЗначениеЗаполнено(Проба) Тогда
		Предупреждение("Не выбрана проба металла для расчета!", 60);
		Возврат;
	КонецЕсли; 	 
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПоНесколькимПозициям", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаОтбораРеализацииОпт", , ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуОтбора(ТаблицаЗапроса)
	УдСтроки = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаРезультатОтбора Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла;
	Для каждого Эл Из УдСтроки Цикл
		ТаблицаРезультатОтбора.Удалить(Эл.Значение);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамМножественныйФильтр(СтруктураОтбора)
    ТаблицаРезультатОтбора.Очистить();
	
	СтрокаФильтр = ""; 
	Если НЕ СтруктураОтбора.ПробыМеталла.Количество() = 0 Тогда		
		СтрокаО = "";
		Для каждого Эл Из СтруктураОтбора.ПробыМеталла Цикл 
			СтрокаО = СтрокаО + ?(ПустаяСтрока(СтрокаО), "", ", ") + СокрЛП(Эл.Значение);
		КонецЦикла;	 
		СтрокаФильтр = СтрокаФильтр + ?(ПустаяСтрока(СтрокаФильтр), "", "; ") + СтрокаО;
	КонецЕсли;
	
	Если НЕ СтруктураОтбора.Категории.Количество() = 0 Тогда
		СтрокаО = "";
		Для каждого Эл Из СтруктураОтбора.Категории Цикл 
			СтрокаО = СтрокаО + ?(ПустаяСтрока(СтрокаО), "", ", ") + СокрЛП(Эл.Значение);
		КонецЦикла;	
		СтрокаФильтр = СтрокаФильтр + ?(ПустаяСтрока(СтрокаФильтр), "", "; ") + СтрокаО;
	КонецЕсли;
	
	Если НЕ СтруктураОтбора.Группы.Количество() = 0 Тогда
		СтрокаО = "";
		Для каждого Эл Из СтруктураОтбора.Группы Цикл 
			СтрокаО = СтрокаО + ?(ПустаяСтрока(СтрокаО), "", ", ") + СокрЛП(Эл.Значение);
		КонецЦикла;	 
		СтрокаФильтр = СтрокаФильтр + ?(ПустаяСтрока(СтрокаФильтр), "", "; ") + СтрокаО;
	КонецЕсли;
	
	Если СтруктураОтбора.ИзделияСБриллиантами Тогда 
        СтрокаФильтр = СтрокаФильтр + ?(ПустаяСтрока(СтрокаФильтр), "", "; ") + "с бриллиантами";
	КонецЕсли; 
	
	Если СтруктураОтбора.ИзделияБезВставок Тогда 
        СтрокаФильтр = СтрокаФильтр + ?(ПустаяСтрока(СтрокаФильтр), "", "; ") + "без вставок";
	КонецЕсли; 
	
	Если СтруктураОтбора.ИзделияСНесколькимиМеталлами Тогда 
        СтрокаФильтр = СтрокаФильтр + ?(ПустаяСтрока(СтрокаФильтр), "", "; ") + "с несколькими металлами";
	КонецЕсли; 
	
	Если НЕ СтруктураОтбора.ПробыМеталла.Количество() = 0 Тогда
	     ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоПробе(Дата, Организация, Ломбард, Склад, СтруктураОтбора.ПробыМеталла);  
		 Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда 
			 ТаблицаРезультатОтбора.Загрузить(ТаблицаЗапроса); 
		 Иначе              
			 Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ СтруктураОтбора.Категории.Количество() = 0 Тогда  
		ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоКатегории(Дата, Организация, Ломбард, Склад, СтруктураОтбора.Категории);
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда  
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда
		        ТаблицаРезультатОтбора.Загрузить(ТаблицаЗапроса); 
			Иначе 
				ЗаполнитьТаблицуОтбора(ТаблицаЗапроса);
			КонецЕсли;	
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда 
				Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
			КонецЕсли;	
		Иначе     
			Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
		КонецЕсли;	
	КонецЕсли;	   
	
	Если НЕ СтруктураОтбора.Группы.Количество() = 0 Тогда  
		ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоГруппам(Дата, Организация, Ломбард, Склад, СтруктураОтбора.Группы);
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда  
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда
		        ТаблицаРезультатОтбора.Загрузить(ТаблицаЗапроса); 
			Иначе 
				ЗаполнитьТаблицуОтбора(ТаблицаЗапроса);
			КонецЕсли;	
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда 
				Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
			КонецЕсли;	
		Иначе     
			Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
		КонецЕсли;	
	КонецЕсли;	
	
	Если СтруктураОтбора.ИзделияСБриллиантами Тогда  
		ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоВставкамБриллианты(Дата, Организация, Ломбард, Склад);
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда  
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда
		        ТаблицаРезультатОтбора.Загрузить(ТаблицаЗапроса); 
			Иначе 
				ЗаполнитьТаблицуОтбора(ТаблицаЗапроса);
			КонецЕсли;	
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда 
				Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
			КонецЕсли;	
		Иначе     
			Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
		КонецЕсли;	
	КонецЕсли;	

    Если СтруктураОтбора.ИзделияБезВставок Тогда  
		ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаБезВставок(Дата, Организация, Ломбард, Склад);
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда  
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда
		        ТаблицаРезультатОтбора.Загрузить(ТаблицаЗапроса); 
			Иначе 
				ЗаполнитьТаблицуОтбора(ТаблицаЗапроса);
			КонецЕсли;	
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда 
				Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
			КонецЕсли;	
		Иначе     
			Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
		КонецЕсли;	
	КонецЕсли;
	
	Если СтруктураОтбора.ИзделияСНесколькимиМеталлами Тогда  
		ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоДопМеталлам(Дата, Организация, Ломбард, Склад);
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда  
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда
		        ТаблицаРезультатОтбора.Загрузить(ТаблицаЗапроса); 
			Иначе 
				ЗаполнитьТаблицуОтбора(ТаблицаЗапроса);
			КонецЕсли;	
			Если ТаблицаРезультатОтбора.Количество() = 0 Тогда 
				Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
			КонецЕсли;	
		Иначе     
			Возврат "По выбранному фильтру """ + СтрокаФильтр + """ изделия на складе не найдены.";
		КонецЕсли;	
	КонецЕсли;	

	Если НЕ ТаблицаРезультатОтбора.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаРезультатОтбора);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ПослеВыбораПоНесколькимПозициям(Результат, ДопПараметры) Экспорт
    Если Результат = неопределено Тогда
        Возврат;
	КонецЕсли;    
	
	СтрокаСообщение = ПолучитьТоварыПоОстаткамМножественныйФильтр(Результат);
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	ТаблицаТоваров.Очистить();
КонецПроцедуры
